#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2013-2016 Nomura Research Institute, Ltd.
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# http://forgerock.org/license/CDDLv1.0.html
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at http://forgerock.org/license/CDDLv1.0.html
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions copyright [year] [name of copyright owner]"
#

# Portions Copyrighted 2013-2016 ForgeRock AS.
# Portions Copyrighted 2014-2015 Open Source Solution Technology Corporation.

forgerock-oauth2-provider-description=OAuth2/OpenID \u30d7\u30ed\u30d0\u30a4\u30c0

# Global settings
g101=OpenID Connect \u30af\u30ec\u30fc\u30e0\u62e1\u5f35\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
g101.help=\u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u500b\u3005\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u5b9f\u884c\u53ef\u80fd\u306a\u6700\u5927\u6642\u9593(\u79d2\u5358\u4f4d)\u3002
g101.help.txt=\u3053\u306e\u5b9f\u884c\u6642\u9593\u5f8c\u306b\u3001\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u5f37\u5236\u7684\u306b\u505c\u6b62\u3057\u307e\u3059\u3002
g102=\u30b3\u30a2\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba
g102.help=The core size of the thread pool from which scripts will operate.
g103=Maximum thread pool size
g103.help=The maximum size of the thread pool from which scripts will operate.
g103.help.txt=New threads will be created up to this size once the task queue reaches capacity. Has no effect if the \
  queue is unbounded.
g104=Thread pool queue size
g104.help=Size of queue to use for buffering script execution request when core pool is at capacity.
g104.help.txt=Use -1 for an unbounded queue (this disables the maximum pool size setting). For short, CPU-bound \
  scripts, consider a small pool size and larger queue length. For I/O-bound scripts (e.g., REST calls) consider \
  a larger maximum pool size and a smaller queue. Not hot-swappable: restart server for changes to take effect.
g105=Thread idle timeout (seconds)
g105.help=Length of time (in seconds) to wait before terminating threads.
g105.help.txt=Length of time (in seconds) to wait before terminating threads that were started when the queue reached \
  capacity. Only applies to threads beyond the core pool size (up to the maximum size).
g106=Java class whitelist
g106.help=List of patterns of allowed Java classes that may be loaded/accessed by scripts.
g106.help.txt=Each Java class accessed by a script must match at least one of these patterns. Use '*' as a wildcard, \
  e.g. <code>java.lang.*</code>
g107=Java class blacklist
g107.help=List of patterns of Java classes that must not be accessed by a script.
g107.help.txt=This blacklist is applied after the whitelist to apply additional restrictions. For instance you may \
  whitelist java.lang.* and then blacklist java.lang.System and java.lang.Runtime. It is recommended to always prefer \
  specific whitelists where possible.
g108=Use system SecurityManager
g108.help=Indicates whether the system SecurityManager should also be consulted when checking access to Java classes.
g108.help.txt=If enabled, then the checkPackageAccess method will be called for each Java class accessed. If no \
  SecurityManager is configured, then this has no effect.

a100=\u8a8d\u53ef\u30b3\u30fc\u30c9\u306e\u6709\u52b9\u671f\u9593(\u79d2)
a100.help=\u8a8d\u53ef\u30b3\u30fc\u30c9\u304c\u6709\u52b9\u306a\u79d2\u6570\u3002
a101=\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30c8\u30fc\u30af\u30f3\u306e\u6709\u52b9\u671f\u9593(\u79d2)
a101.help=\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30c8\u30fc\u30af\u30f3\u304c\u6709\u52b9\u306a\u79d2\u6570\u3002\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306b-1\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30c8\u30fc\u30af\u30f3\u306e\u6709\u52b9\u671f\u9650\u304c\u5207\u308c\u308b\u3053\u3068\u306f\u3042\u308a\u307e\u305b\u3093\u3002
a102=\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u306e\u6709\u52b9\u671f\u9593(\u79d2)
a102.help=\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u304c\u6709\u52b9\u306a\u79d2\u6570\u3002
a103=\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30c8\u30fc\u30af\u30f3\u306e\u767a\u884c
a103.help=\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30c8\u30fc\u30af\u30f3\u306e\u751f\u6210\u3092\u6709\u52b9\u306b\u3059\u308b\u5834\u5408\u306f\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059\u3002
a103a=\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u6642\u306e\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30c8\u30fc\u30af\u30f3\u306e\u767a\u884c
a103a.help=\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u3092\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u3059\u308b\u969b\u306b\u3001\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30c8\u30fc\u30af\u30f3\u306e\u751f\u6210\u3092\u53ef\u80fd\u306b\u3059\u308b\u5834\u5408\u306f\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059\u3002
a103b=Custom Login URL Template
a103b.help=A Freemarker template which will create a custom URL for the login page to authenticate the resource owner. \
  The following values are available to the Freemarker template: gotoUrl - the URL to redirect back to the OAuth2 \
  authorization process, acrValues - the acr values for the OAuth2 authorization request, realm - the OpenAM realm \
  the OAuth2 authorization request was made on, module - the name of the OpenAM authentication module requested to \
  perform resource owner authentication, service - the name of the OpenAM authentication chain requested to perform \
  resource owner authentication, locale - a space separated list of locales ordered by preference.
a104=\u30b9\u30b3\u30fc\u30d7\u5b9f\u88c5\u30af\u30e9\u30b9
a104aa=OIDC Claims Script.
a104aa.help=This is a script that will be run, when using an implementation of the \
  org.forgerock.openam.oauth2.OpenAMScopeValidator, when issuing an ID Token or making a request to the userinfo \
  endpoint that will gather and fill in all claims for the request. The script has access to the requested scopes, \
  the access token, the user's session (if available), the user's identity.
a104ab=OIDC Claims Script Type.
a104ab.help=This is the language of the OIDC claims script
scriptGroovyChoice=Groovy
scriptJavaScriptChoice=JavaScript
a105=\u5fdc\u7b54\u30bf\u30a4\u30d7\u30d7\u30e9\u30b0\u30a4\u30f3
a105.help=code|\u30d7\u30e9\u30b0\u30a4\u30f3\u30af\u30e9\u30b9\u540d \u306e\u3088\u3046\u306b\u5165\u529b\u3055\u308c\u305f\u5fdc\u7b54\u30bf\u30a4\u30d7\u3002\u4f8b\u3048\u3070\u3001code|org.forgerock.openam.oauth2.CodeClass \u3002\
  \u5b9f\u88c5\u30af\u30e9\u30b9\u304c\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u30af\u30e9\u30b9\u540d\u306e\u4ee3\u308f\u308a\u306b none \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\u4f8b\u3048\u3070\u3001id_token|none \u3002
a106=\u30ea\u30bd\u30fc\u30b9\u30aa\u30fc\u30ca\u30fc\u304c\u8a8d\u8a3c\u3055\u308c\u308b\u969b\u306b\u4f7f\u308f\u308c\u308b\u30e6\u30fc\u30b6\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5c5e\u6027
a106.help=\u5c5e\u6027\u304c mail \u3068 uid \u3067\u3042\u308b\u5834\u5408\u3001\u691c\u7d22\u6587\u5b57\u5217 (|(mail=user)(uid=user)) \u304c\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
  \u3053\u3053\u3067\u306e user \u3068\u306f\u8a8d\u8a3c\u6642\u306b\u5165\u529b\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u540d\u306e\u3053\u3068\u3067\u3059\u3002
a107=\u4fdd\u5b58\u3055\u308c\u308b\u540c\u610f\u5c5e\u6027\u540d
a107.help=\u4fdd\u5b58\u3055\u308c\u308b\u540c\u610f\u3092\u4f7f\u7528\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30ea\u30b9\u30c8\u5c5e\u6027\u304c\u8a2d\u5b9a\u3055\u308c\u3001\u305d\u306e\u540d\u524d\u304c\u63d0\u4f9b\u3055\u308c\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a1075=User Display Name attribute
a1075.help=The attribute for identities retrieved from the ID Repository that contains a displayable name for the user \
  for use in the consent page.
a108=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30b9\u30b3\u30fc\u30d7
a108.help=A list of scopes this authorization server supports, with translations.
a108.help.txt=Scopes may be entered as simple strings or pipe separated strings representing the internal scope name, \
  locale, and localized description; e.g. "read|en|Permission to view email messages in your account". Locale strings \
  are in the format <code>language + "_" + country + "_" + variant</code>, e.g. en, en_GB, en_US_WIN. \
  If the locale and pipe is omitted, the description is displayed to all users having undefined locales. \
  e.g. "read|Permission to view email messages in your account". \
  <i>NB</i> If the description is also omitted, nothing is displayed to all users, e.g. specifying "read|" would allow \
  the scope "read" to be used by the client, but would not display it to the user when it was requested.
a109=\u30ea\u30e2\u30fc\u30c8 JSON Web \u30ad\u30fc URL
a109.help=\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e JSON Web \u30ad\u30fc\u3092\u53d6\u5f97\u3067\u304d\u308b\u30ea\u30e2\u30fc\u30c8 URL \u3002
a110=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30b5\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30bf\u30a4\u30d7
a110.help=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30b5\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30bf\u30a4\u30d7\u306e\u30ea\u30b9\u30c8\u3002\u5024\u306f pairwise \u304a\u3088\u3073 public \u3067\u3059\u3002pairwise \u306f confidential \u3068\u540c\u3058\u3067\u3059\u3002
a111=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b ID \u30c8\u30fc\u30af\u30f3\u7f72\u540d\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0
a111.help=ID \u30c8\u30fc\u30af\u30f3\u306e\u7f72\u540d\u306e\u305f\u3081\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3002
a112=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30af\u30ec\u30fc\u30e0
a112.help=List of claims supported by the userinfo endpoint, with translations.
a112.help.txt=Claims may be entered as simple strings or pipe separated strings representing the internal claim name, \
  locale, and localized description; e.g. "read|en|Permission to view email messages in your account". Locale strings \
  are in the format <code>language + "_" + country + "_" + variant</code>, e.g. en, en_GB, en_US_WIN. \
  If the locale and pipe is omitted, the description is displayed to all users having undefined locales. \
  e.g. "name|Your full name". \
  <i>NB</i> If the description is also omitted, nothing is displayed to all users, e.g. specifying "name|" would allow \
  the claim "name" to be used by the client, but would not display it to the user when it was requested.
a113=OpenID Connect JWT \u30c8\u30fc\u30af\u30f3\u306e\u6709\u52b9\u671f\u9593\uff08\u79d2\uff09
a113.help=JWT \u304c\u6709\u52b9\u3067\u3042\u308b\u6642\u9593\uff08\u79d2\uff09\u3002
a114=ID \u30c8\u30fc\u30af\u30f3\u7f72\u540d\u9375\u306e\u30a8\u30a4\u30ea\u30a2\u30b9
a114.help=\u30ad\u30fc\u30b9\u30c8\u30a2\u306b\u4fdd\u5b58\u3057\u305f\u30ad\u30fc\u306e\u540d\u524d\u3002\u30ad\u30fc\u306f OpenAM \u306b\u3088\u3063\u3066\u767a\u884c\u3055\u308c\u305f ID \u30c8\u30fc\u30af\u30f3\u306b\u7f72\u540d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a115=\u52d5\u7684\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u767b\u9332\u306e\u516c\u958b\u3092\u8a31\u53ef\u3059\u308b
a115.help=\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u7121\u3057\u3067\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3092\u767b\u9332\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002\u6709\u52b9\u306b\u3059\u308b\u5834\u5408\u306f\u3001\u30ec\u30fc\u30c8\u5236\u9650\u3092\u8ffd\u52a0\u3059\u308b\u3053\u3068\u3092\u691c\u8a0e\u3059\u3079\u304d\u3067\u3059\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001OpenID Connect \u306e <a href="http://openid.net/specs/openid-connect-registration-1_0.html#ClientRegistration"    target="_blank">Client Registration</a> \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
a116=\u767b\u9332\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u306e\u751f\u6210 
a116.help=\u516c\u958b\u3055\u308c\u305f\u52d5\u7684\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u767b\u9332\u3092\u4ecb\u3057\u3066\u767b\u9332\u3055\u308c\u308b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u5bfe\u3057\u3001\u767b\u9332\u7528\u306e\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u3092\u751f\u6210\u3059\u308b\u304b\u3069\u3046\u304b\u3002\u3053\u306e\u30c8\u30fc\u30af\u30f3\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c OpenID Connect \u306e\u4ed5\u69d8\u306b\u5f93\u3063\u3066 <a    href="http://openid.net/specs/openid-connect-registration-1_0.html#ClientConfigurationEndpoint"    target="_blank">Client Configuration Endpoint</a> \u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u3053\u3068\u3092\u8a31\u53ef\u3057\u307e\u3059\u3002\u516c\u958b\u3055\u308c\u305f\u52d5\u7684\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u767b\u9332\u304c\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u306e\u8a2d\u5b9a\u306f\u7121\u52b9\u3067\u3059\u3002
a117=\u8a8d\u8a3c\u9023\u9396\u306b\u30de\u30c3\u30d4\u30f3\u30b0\u3059\u308b OpenID Connect \u306e acr_values 
a117.help=\u8a8d\u8a3c\u9023\u9396\u306b\u30de\u30c3\u30d4\u30f3\u30b0\u3059\u308b OpenID Connect \u306e ACR \u306e\u5024\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001OpenID Connect \u306e\u8a8d\u8a3c\u8981\u6c42\u4ed5\u69d8\u306e <a    href="http://openid.net/specs/openid-connect-core-1_0.html#AuthRequest" target="_blank">acr_values \u30d1\u30e9\u30e1\u30fc\u30bf</a> \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
a118=OpenID Connect \u306e\u30c7\u30d5\u30a9\u30eb\u30c8 acr \u30af\u30ec\u30fc\u30e0
a118.help=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u8a8d\u8a3c\u9023\u9396\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306b\u3001OpenID Connect \u306e ID \u30c8\u30fc\u30af\u30f3\u5185\u306e 'acr' \u30af\u30ec\u30fc\u30e0\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u3002
a119=\u8a8d\u8a3c\u9023\u9396\u306b\u30de\u30c3\u30d4\u30f3\u30b0\u3059\u308b OpenID Connect \u306e ID \u30c8\u30fc\u30af\u30f3\u306e amr \u5024
a119.help=OpenID Connect \u306e <code>id_token</code> \u5185\u306b\u8fd4\u3055\u308c\u308b <code>amr</code> \u5024\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001\u3053\u3053\u3067\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u4e00\u5ea6\u8a8d\u8a3c\u304c\u5b8c\u4e86\u3059\u308b\u3068\u3001\u8a8d\u8a3c\u30b5\u30fc\u30d3\u30b9\u304b\u3089\u4f7f\u7528\u3055\u308c\u305f\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f <code>amr</code> \u5024\u306b\u30de\u30c3\u30d4\u30f3\u30b0\u3055\u308c\u307e\u3059\u3002 amr \u5024\u3092\u5fc5\u8981\u3068\u3057\u306a\u3044\u3001\u307e\u305f\u306f OpenID Connect \u306e\u30c8\u30fc\u30af\u30f3\u3092\u307e\u3063\u305f\u304f\u63d0\u4f9b\u3057\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u7a7a\u767d\u306e\u307e\u307e\u306b\u3067\u304d\u307e\u3059\u3002
a120=\u66f4\u65b0\u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7\u5c5e\u6027\u540d 
a120.help=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30ea\u30dd\u30b8\u30c8\u30ea\u5185\u306e\u66f4\u65b0\u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7\u5c5e\u6027\u540d \uff08\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u30b5\u30fc\u30d3\u30b9\u30da\u30fc\u30b8\u306e\u30e6\u30fc\u30b6\u30fc\u5c5e\u6027\u4e00\u89a7\u306b\u3082\u8ffd\u52a0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\uff09\u3002 
a121=\u4f5c\u6210\u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7\u5c5e\u6027\u540d 
a121.help=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30ea\u30dd\u30b8\u30c8\u30ea\u5185\u306e\u4f5c\u6210\u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7\u5c5e\u6027\u540d \uff08\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u30b5\u30fc\u30d3\u30b9\u30da\u30fc\u30b8\u306e\u30e6\u30fc\u30b6\u30fc\u5c5e\u6027\u4e00\u89a7\u306b\u3082\u8ffd\u52a0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\uff09\u3002 
a122=Default Client Scopes
a122.help=List of scopes a client will be granted if they request registration without specifying which scopes they \
  want. Default scopes are NOT auto-granted to clients created through the administrator interface.
a123=Enable "claims_parameter_supported"
a123.help=If enabled, clients will be able to request individual claims using the "claims" Request Parameter \
  as per section 5.5 of the OpenID Connect specification.
a124=Subject identifier hash salt
a124.help=If pairwise subject types are supported, it is STRONGLY RECOMMENDED to set this value. It is used in \
  the salting of hashes for returning specific sub claims to individuals using the same request_uri or \
  sector_identifier_uri.
a125=Always return claims in ID Tokens
a125.help=All id_tokens will contain scope-derived claims. Warning: not strictly spec-compliant.
a125.help.txt=The <a href="http://openid.net/specs/openid-connect-core-1_0.html#ScopeClaims">OpenID Connect \
  specification</a> is ambiguous whether scope-derived claims should always be added to the ID Token. This is \
  disabled by default in order to guarantee compliance, but can be enabled for situations where calling the \
  userinfo endpoint is not practical, but an access token is still wanted.
a126=Code verifier parameter required
a126.help=If enabled, Authorization Code requests will require a "code_challenge" attribute
a126.help.txt=The spec for this feature can be found <a href="https://tools.ietf\
  .org/html/draft-ietf-oauth-spop-12">here</a>
a127=Verification URL
a127.help=The URL that the user will be instructed to visit to complete their OAuth 2 login and consent when using \
  the device code flow.
a128=Device Completion URL
a128.help=The URL that the user will be sent to on completion of their OAuth 2 login and consent when using \
  the device code flow.
a129=Device Code Lifetime (seconds)
a129.help=The lifetime of the device code.
a130=Device Polling Interval
a130.help=The polling frequency for devices waiting for tokens when using the device code flow.
