# The contents of this file are subject to the terms of the Common Development and
# Distribution License (the License). You may not use this file except in compliance with the
# License.
#
# You can obtain a copy of the License at legal/CDDLv1.0.txt. See the License for the
# specific language governing permission and limitations under the License.
#
# When distributing Covered Software, include this CDDL Header Notice in each file and include
# the License file at legal/CDDLv1.0.txt. If applicable, add the following below the CDDL
# Header, with the fields enclosed by brackets [] replaced by your own identifying
# information: "Portions copyright [year] [name of copyright owner]".
#
# Copyright 2015-2016 Nomura Research Institute, Ltd.
#
# Portions Copyrighted 2015-2016 ForgeRock AS.

# Module name on console
iplanet-am-auth-scripted-service-description=\u30b9\u30af\u30ea\u30d7\u30c8\u30e2\u30b8\u30e5\u30fc\u30eb

# Global settings
g101=\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b9\u30af\u30ea\u30d7\u30c8\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
g101.help=\u5404\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u5b9f\u884c\u53ef\u80fd\u306a\u6700\u5927\u5b9f\u884c\u6642\u9593\uff08\u79d2\uff09\u3002 
g101.help.txt=\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u3053\u306e\u5b9f\u884c\u6642\u9593\u3092\u7d4c\u904e\u3059\u308b\u3068\u5f37\u5236\u7684\u306b\u505c\u6b62\u3055\u308c\u307e\u3059\u3002 
g102=\u30b3\u30a2\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba
g102.help=\u30b9\u30af\u30ea\u30d7\u30c8\u5b9f\u884c\u4e2d\u306e\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u306e\u30b3\u30a2\u30b5\u30a4\u30ba\u3002 
g103=\u6700\u5927\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba
g103.help=\u30b9\u30af\u30ea\u30d7\u30c8\u5b9f\u884c\u4e2d\u306e\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u306e\u6700\u5927\u30b5\u30a4\u30ba\u3002 
g103.help.txt=\u30bf\u30b9\u30af\u30ad\u30e5\u30fc\u304c\u5bb9\u91cf\u306b\u9054\u3059\u308b\u3068\u3001\u65b0\u3057\u3044\u30b9\u30ec\u30c3\u30c9\u304c\u3053\u306e\u30b5\u30a4\u30ba\u307e\u3067\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002\
  \u30ad\u30e5\u30fc\u304c\u7121\u5236\u9650\u306e\u5834\u5408\u306f\u52b9\u679c\u304c\u3042\u308a\u307e\u305b\u3093\u3002 
g104=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u306e\u30ad\u30e5\u30fc\u30b5\u30a4\u30ba
g104.help=\u30b3\u30a2\u30d7\u30fc\u30eb\u306e\u5bb9\u91cf\u304c\u3042\u308b\u5834\u5408\u306b\u3001\u30b9\u30af\u30ea\u30d7\u30c8\u5b9f\u884c\u8981\u6c42\u306e\u30d0\u30c3\u30d5\u30a1\u30ea\u30f3\u30b0\u306b\u4f7f\u7528\u3059\u308b\u30ad\u30e5\u30fc\u306e\u30b5\u30a4\u30ba\u3002 
g104.help.txt=\u30a2\u30f3\u30d0\u30a6\u30f3\u30c9\u30ad\u30e5\u30fc\u306e\u5834\u5408\u306f -1 \u3092\u4f7f\u7528\u3057\u307e\u3059\uff08\u3053\u308c\u306f\u3001\u6700\u5927\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba\u306e\u8a2d\u5b9a\u3092\u7121\u52b9\u306b\u3057\u307e\u3059\uff09\u3002\u7c21\u5358\u306b\u8a00\u3046\u3068\u3001CPU \u30d0\u30a6\u30f3\u30c9\u306e\
  \u30b9\u30af\u30ea\u30d7\u30c8\u306e\u5834\u5408\u306f\u3001\u5c0f\u3055\u3044\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba\u3068\u5927\u304d\u3044\u30ad\u30e5\u30fc\u30b5\u30a4\u30ba\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002I/O \u30d0\u30a6\u30f3\u30c9\u306e\u30b9\u30af\u30ea\u30d7\u30c8\uff08\u4f8b\u3048\u3070\u3001REST \u547c\u3073\u51fa\u3057\uff09\u306e\u5834\u5408\u306f\u3001\
  \u5927\u304d\u3044\u6700\u5927\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba\u3068\u5c0f\u3055\u3044\u30ad\u30e5\u30fc\u30b5\u30a4\u30ba\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30db\u30c3\u30c8\u30b9\u30ef\u30c3\u30d7\u4e0d\u53ef: \u5909\u66f4\u3092\u53cd\u6620\u3059\u308b\u305f\u3081\u306b\u30b5\u30fc\u30d0\u30fc\u3092\u518d\u8d77\u52d5\u3057\u3066\u304f\u3060\u3055\u3044\u3002
g105=\u30b9\u30ec\u30c3\u30c9\u306e\u30a2\u30a4\u30c9\u30eb\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\uff08\u79d2\uff09 
g105.help=\u30b9\u30ec\u30c3\u30c9\u3092\u7834\u68c4\u3059\u308b\u524d\u306b\u5f85\u6a5f\u3059\u308b\u6642\u9593\uff08\u79d2\uff09\u3002
g105.help.txt=\u30ad\u30e5\u30fc\u304c\u5bb9\u91cf\u306b\u9054\u3057\u305f\u3068\u304d\u306b\u958b\u59cb\u3055\u308c\u305f\u30b9\u30ec\u30c3\u30c9\u3092\u7834\u68c4\u3059\u308b\u307e\u3067\u306e\u5f85\u6a5f\u6642\u9593\uff08\u79d2\uff09\u3002\u30b3\u30a2\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba\u3092\u8d85\u3048\u305f\u30b9\u30ec\u30c3\u30c9\u306b\u306e\u307f\
  \u9069\u7528\u3055\u308c\u307e\u3059\uff08\u6700\u5927\u30b5\u30a4\u30ba\u307e\u3067\uff09\u3002
g106=Java \u30af\u30e9\u30b9\u306e\u30db\u30ef\u30a4\u30c8\u30ea\u30b9\u30c8 
g106.help=\u30b9\u30af\u30ea\u30d7\u30c8\u306b\u3088\u3063\u3066\u30a2\u30af\u30bb\u30b9/\u30ed\u30fc\u30c9\u3059\u308b\u3053\u3068\u3092\u8a31\u53ef\u3055\u308c\u305f Java \u30af\u30e9\u30b9\u306e\u30d1\u30bf\u30fc\u30f3\u306e\u30ea\u30b9\u30c8\u3002 
g106.help.txt=\u30b9\u30af\u30ea\u30d7\u30c8\u306b\u3088\u3063\u3066\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u5404 Java \u30af\u30e9\u30b9\u306f\u3001\u3053\u308c\u3089\u306e\u30d1\u30bf\u30fc\u30f3\u306e\u3044\u305a\u308c\u304b\u306b\u4e00\u81f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\
  \u30ef\u30a4\u30eb\u30c9\u30ab\u30fc\u30c9\u306b\u306f '*' \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\u4f8b java.lang.*
g107=Java \u30af\u30e9\u30b9\u306e\u30d6\u30e9\u30c3\u30af\u30ea\u30b9\u30c8 
g107.help=\u30b9\u30af\u30ea\u30d7\u30c8\u306b\u3088\u3063\u3066\u30a2\u30af\u30bb\u30b9/\u30ed\u30fc\u30c9\u3059\u308b\u3053\u3068\u3092\u7981\u6b62\u3055\u308c\u305f Java \u30af\u30e9\u30b9\u306e\u30d1\u30bf\u30fc\u30f3\u306e\u30ea\u30b9\u30c8\u3002 
g107.help.txt=\u8ffd\u52a0\u306e\u5236\u9650\u3092\u9069\u7528\u3059\u308b\u305f\u3081\u306b\u3001\u3053\u306e\u30d6\u30e9\u30c3\u30af\u30ea\u30b9\u30c8\u306f\u30db\u30ef\u30a4\u30c8\u30ea\u30b9\u30c8\u306e\u5f8c\u306b\u9069\u7528\u3055\u308c\u307e\u3059\u3002\u4f8b\u3048\u3070\u3001java.lang.* \u306e\
  \u30db\u30ef\u30a4\u30c8\u30ea\u30b9\u30c8\u3068\u3001java.lang.System \u304a\u3088\u3073 java.lang.Runtime \u306e\u30d6\u30e9\u30c3\u30af\u30ea\u30b9\u30c8\u306e\u3088\u3046\u306a\u8a2d\u5b9a\u304c\u8003\u3048\u3089\u308c\u307e\u3059\u3002\
  \u53ef\u80fd\u306a\u5834\u5408\u306f\u3001\u5e38\u306b\u7279\u5b9a\u306e\u30db\u30ef\u30a4\u30c8\u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
g108=\u30b7\u30b9\u30c6\u30e0\u306e SecurityManager \u3092\u4f7f\u7528\u3059\u308b 
g108.help=Java \u30af\u30e9\u30b9\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u969b\u306b\u3001\u30b7\u30b9\u30c6\u30e0\u306e SecurityManager \u306b\u3082\u554f\u3044\u5408\u308f\u305b\u308b\u5fc5\u8981\u304c\u3042\u308b\u304b\u3092\u8868\u3057\u307e\u3059\u3002 
g108.help.txt=\u6709\u52b9\u306b\u3057\u305f\u5834\u5408\u306f\u3001\u30a2\u30af\u30bb\u30b9\u3055\u308c\u305f\u5404 Java \u30af\u30e9\u30b9\u306b\u5bfe\u3057\u3066 checkPackageAccess \u30e1\u30bd\u30c3\u30c9\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3059\u3002\
  SecurityManager \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u3053\u306e\u8a2d\u5b9a\u306f\u5f71\u97ff\u3092\u4e0e\u3048\u307e\u305b\u3093\u3002

# Module settings
a101=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u6709\u52b9\u306b\u3059\u308b 
a101.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u5b9f\u884c\u3059\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u8a2d\u5b9a\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002 
a102=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u30b9\u30af\u30ea\u30d7\u30c8
a102.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u30b9\u30af\u30ea\u30d7\u30c8\u3002
a103=\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b9\u30af\u30ea\u30d7\u30c8\u8a00\u8a9e 
a103.help=\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u8a18\u8ff0\u3059\u308b\u8a00\u8a9e\u3002 
a103.help.txt=\u3053\u308c\u306f\u3001\u3069\u306e\u3088\u3046\u306b\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u691c\u8a3c\u3059\u308b\u304b\u3060\u3051\u3067\u306a\u304f\u3001\u3069\u306e\u30a8\u30f3\u30b8\u30f3\u5185\u3067\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u5b9f\u884c\u3059\u308b\u304b\u3092\u6c7a\u5b9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 
a104=\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b9\u30af\u30ea\u30d7\u30c8 
a104.help=\u5b9f\u884c\u3059\u308b\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u3002 
a104.help.txt=\u3053\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u3059\u3079\u3066\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u5b9f\u884c\u3055\u308c\u305f\u5f8c\u3001\u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u5b9f\u884c\u3055\u308c\u307e\u3059\u3002\
  \u9078\u629e\u3055\u308c\u305f\u8a00\u8a9e\u3067\u8a18\u8ff0\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
a500=\u8a8d\u8a3c\u30ec\u30d9\u30eb 
a500.help=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u3057\u305f\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3002 
a500.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
  0(\u30c7\u30d5\u30a9\u30eb\u30c8)\u304c\u6700\u4f4e\u3067\u3059\u3002

# Module localizations
choice1=JavaScript
choice2=Groovy
language-not-supported=\u9078\u629e\u3057\u305f\u30b9\u30af\u30ea\u30d7\u30c8\u8a00\u8a9e\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
