#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 2016 Nomura Research Institute, Ltd.
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# http://forgerock.org/license/CDDLv1.0.html
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at http://forgerock.org/license/CDDLv1.0.html
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions copyright [year] [name of copyright owner]"
#
# Portions Copyrighted 2016 ForgeRock AS.
#

forgerock-am-uma-service-description=UMA \u30d7\u30ed\u30d0\u30a4\u30c0
a101=\u30ea\u30af\u30a8\u30b9\u30c6\u30a3\u30f3\u30b0\u30d1\u30fc\u30c6\u30a3\u30fc\u30c8\u30fc\u30af\u30f3\u306e\u6709\u52b9\u671f\u9593(\u79d2)
a101.help=\u30ea\u30af\u30a8\u30b9\u30c6\u30a3\u30f3\u30b0\u30d1\u30fc\u30c6\u30a3\u30fc\u30c8\u30fc\u30af\u30f3 (RPT) \u304c\u6709\u52b9\u671f\u9650\u5207\u308c\u306b\u306a\u308b\u307e\u3067\u306e\u9577\u3055\u3002
a102=\u8a31\u53ef\u30c1\u30b1\u30c3\u30c8\u306e\u6709\u52b9\u671f\u9593(\u79d2)
a102.help=\u8a31\u53ef\u30c1\u30b1\u30c3\u30c8\u304c\u6709\u52b9\u671f\u9650\u5207\u308c\u306b\u306a\u308b\u307e\u3067\u306e\u9577\u3055\u3002
a103=\u30ea\u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u304c\u524a\u9664\u3055\u308c\u305f\u969b\u306b\u30e6\u30fc\u30b6\u30fc\u30dd\u30ea\u30b7\u30fc\u3082\u524a\u9664\u3059\u308b
a103.help=\u30ea\u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u304c OpenAM \u304b\u3089\u524a\u9664\u3055\u308c\u305f\u969b\u306b\u3001\u30ea\u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u306b\u95a2\u9023\u3059\u308b\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u30dd\u30ea\u30b7\u30fc\u3082\
  \u524a\u9664\u3059\u308b\u304b\u3069\u3046\u304b\u3002\u30ea\u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u306e\u524a\u9664\u306f\u3001OAuth2 \u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306e\u30a8\u30f3\u30c8\u30ea\u3092\u524a\u9664\u3059\u308b\u304b\u3001\
  OAuth2 \u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304b\u3089 "uma_protection" \u30b9\u30b3\u30fc\u30d7\u3092\u524a\u9664\u3059\u308b\u304b\u306e\u3044\u305a\u308c\u304b\u306b\u3088\u3063\u3066\u884c\u308f\u308c\u307e\u3059\u3002
a104=\u30ea\u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u304c\u524a\u9664\u3055\u308c\u305f\u969b\u306b\u30ea\u30bd\u30fc\u30b9\u30bb\u30c3\u30c8\u3082\u524a\u9664\u3059\u308b
a104.help=\u30ea\u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u304c OpenAM \u304b\u3089\u524a\u9664\u3055\u308c\u305f\u969b\u306b\u3001\u30ea\u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u306b\u95a2\u9023\u3059\u308b\u3059\u3079\u3066\u306e\u30ea\u30bd\u30fc\u30b9\u30bb\u30c3\u30c8\u3082\
  \u524a\u9664\u3059\u308b\u304b\u3069\u3046\u304b\u3002\u30ea\u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u306e\u524a\u9664\u306f\u3001OAuth2 \u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306e\u30a8\u30f3\u30c8\u30ea\u3092\u524a\u9664\u3059\u308b\u304b\u3001\
  OAuth2 \u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304b\u3089 "uma_protection" \u30b9\u30b3\u30fc\u30d7\u3092\u524a\u9664\u3059\u308b\u304b\u306e\u3044\u305a\u308c\u304b\u306b\u3088\u3063\u3066\u884c\u308f\u308c\u307e\u3059\u3002
a105=\u30da\u30f3\u30c7\u30a3\u30f3\u30b0\u30ea\u30af\u30a8\u30b9\u30c8\u4f5c\u6210\u6642\u306b\u30ea\u30bd\u30fc\u30b9\u30aa\u30fc\u30ca\u30fc\u306b\u96fb\u5b50\u30e1\u30fc\u30eb\u3092\u9001\u4fe1\u3059\u308b
a105.help=\u30ea\u30af\u30a8\u30b9\u30c6\u30a3\u30f3\u30b0\u30d1\u30fc\u30c6\u30a3\u30fc\u304c\u30ea\u30bd\u30fc\u30b9\u3078\u306e\u8a8d\u53ef\u3092\u8981\u6c42\u3059\u308b\u5834\u5408\u3001\u30da\u30f3\u30c7\u30a3\u30f3\u30b0\u30ea\u30af\u30a8\u30b9\u30c8\u4f5c\u6210\u6642\u306b\
  \u30ea\u30bd\u30fc\u30b9\u30aa\u30fc\u30ca\u30fc\u306b\u96fb\u5b50\u30e1\u30fc\u30eb\u3092\u9001\u4fe1\u3059\u308b\u304b\u3069\u3046\u304b\u3002
a106=\u30da\u30f3\u30c7\u30a3\u30f3\u30b0\u30ea\u30af\u30a8\u30b9\u30c8\u627f\u8a8d\u6642\u306b\u30ea\u30af\u30a8\u30b9\u30c6\u30a3\u30f3\u30b0\u30d1\u30fc\u30c6\u30a3\u30fc\u306b\u96fb\u5b50\u30e1\u30fc\u30eb\u3092\u9001\u4fe1\u3059\u308b
a106.help=\u30ea\u30bd\u30fc\u30b9\u30aa\u30fc\u30ca\u30fc\u306b\u3088\u3063\u3066\u30da\u30f3\u30c7\u30a3\u30f3\u30b0\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u627f\u8a8d\u3055\u308c\u308b\u969b\u306b\u3001\u30ea\u30af\u30a8\u30b9\u30c6\u30a3\u30f3\u30b0\u30d1\u30fc\u30c6\u30a3\u30fc\u306b\u96fb\u5b50\u30e1\u30fc\u30eb\u3092\u9001\u4fe1\u3059\u308b\u304b\u3069\u3046\u304b\u3002
a107=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u512a\u5148\u30ed\u30b1\u30fc\u30eb\u5c5e\u6027
a107.help=\u30e6\u30fc\u30b6\u30fc\u306e\u512a\u5148\u30ed\u30b1\u30fc\u30eb\u3092\u4fdd\u5b58\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5c5e\u6027\u3002
a108=\u518d\u5171\u6709\u30e2\u30fc\u30c9
a108.help=\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u5bfe\u3057\u3066\u3001\u6697\u9ed9\u7684\u306b\u518d\u5171\u6709\u3092\u30aa\u30d5\u307e\u305f\u306f\u30aa\u30f3\u306b\u3059\u308b\u304b\u3069\u3046\u304b(\u5171\u6709\u3055\u308c\u3066\u3044\u308b\u30ea\u30bd\u30fc\u30b9\u30bb\u30c3\u30c8\u3092\u3001\
  \u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u518d\u5171\u6709\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059)\u3002
a109=\u30c8\u30e9\u30b9\u30c8\u6607\u683c\u304c\u5fc5\u8981
a109.help=AAT \u304c\u8a8d\u53ef\u8981\u6c42\u306e\u30ea\u30af\u30a8\u30b9\u30c6\u30a3\u30f3\u30b0\u30d1\u30fc\u30c6\u30a3\u30fc\u3092\u6c7a\u5b9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u4e0a\u3067\u5341\u5206\u3067\u3042\u308b\u3068\
  \u8003\u3048\u3089\u308c\u308b\u304b\u3069\u3046\u304b\u3001\u307e\u305f\u306f\u30c8\u30e9\u30b9\u30c8\u6607\u683c\u304c\u5fc5\u8981\u3067\u3001\u30af\u30ec\u30fc\u30e0 (OpenID Connection \u306e ID \u30c8\u30fc\u30af\u30f3\u306e\u3088\u3046\u306a)\u304c\u8a8d\u53ef\u8981\u6c42\u306b\
  \u5b58\u5728\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u304b\u3069\u3046\u304b\u3002
resharingModeChoiceOff=\u30aa\u30d5
resharingModeChoiceImplicit=\u30a4\u30f3\u30d7\u30ea\u30b7\u30c3\u30c8

UmaPendingRequestCreationEmailSubject=\u65b0\u3057\u3044\u30da\u30f3\u30c7\u30a3\u30f3\u30b0\u30ea\u30af\u30a8\u30b9\u30c8
UmaPendingRequestCreationEmailTemplate=<strong>{0}</strong>\u306f\u6b21\u306e\u30b9\u30b3\u30fc\u30d7\u3067<strong>{1}</strong>\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\
  \u8981\u6c42\u3057\u307e\u3057\u305f: {2}<p>\u8981\u6c42\u3092\u8a31\u53ef\u3059\u308b\u306b\u306f <a href=\"{3}/XUI/#uma/requests/{4}\" here> \u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059</p><p>\
  \u30ea\u30bd\u30fc\u30b9\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u9632\u6b62\u3059\u308b\u3001\u307e\u305f\u306f\u4ee3\u308f\u308a\u306b\u8981\u6c42\u3092\u62d2\u5426\u3059\u308b\u305f\u3081\u306b\u30c0\u30c3\u30b7\u30e5\u30dc\u30fc\u30c9\u306b\u79fb\u52d5\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30e1\u30fc\u30eb\u3092\u7121\u8996\u3057\u3066\u304f\u3060\u3055\u3044\u3002</p>
UmaPendingRequestApprovalEmailSubject=\u627f\u8a8d\u3055\u308c\u308b\u30da\u30f3\u30c7\u30a3\u30f3\u30b0\u30ea\u30af\u30a8\u30b9\u30c8
UmaPendingRequestApprovalEmailTemplate=<strong>{0}</strong> \u306f\u30b9\u30b3\u30fc\u30d7\u3067 <strong>{1}</strong> \u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3057\u307e\u3057\u305f: {2}