 # The contents of this file are subject to the terms of the Common Development and
 # Distribution License (the License). You may not use this file except in compliance with the
 # License.
 #
 # You can obtain a copy of the License at legal/CDDLv1.0.txt. See the License for the
 # specific language governing permission and limitations under the License.
 #
 # When distributing Covered Software, include this CDDL Header Notice in each file and include
 # the License file at legal/CDDLv1.0.txt. If applicable, add the following below the CDDL
 # Header, with the fields enclosed by brackets [] replaced by your own identifying
 # information: "Portions copyright [year] [name of copyright owner]".
 #
 # Copyrighted 2015 Intellectual Reserve, Inc (IRI)ß
 # Portions Copyrighted 2016 Nomura Research Institute, Ltd.

radius-server-service-description=RADIUS \u30b5\u30fc\u30d0\u30fc

a-radius-listener-enabled-label=\u6709\u52b9\u5316
a-radius-listener-enabled-label.help=\u6709\u52b9\u306b\u3059\u308b\u3068\u3001RADIUS \u30b5\u30fc\u30d0\u30fc\u306f\u5c02\u7528\u306e\u30dd\u30fc\u30c8\u3092\u30aa\u30fc\u30d7\u30f3\u3057\u3066\u8981\u6c42\u3092\u30ea\u30c3\u30b9\u30f3\u3057\u307e\u3059\u3002
choiceYES=YES
choiceNO=NO

b-radius-port=\u30ea\u30b9\u30ca\u30fc\u30dd\u30fc\u30c8
b-radius-port.help=\u5404 OpenAM \u30b5\u30fc\u30d0\u30fc\u304c RADIUS \u306e Access-Request \u30d1\u30b1\u30c3\u30c8\u3092\u30ea\u30c3\u30b9\u30f3\u3059\u308b UDP \u30dd\u30fc\u30c8\u3002
b-radius-port.help.txt=RADIUS \u8a8d\u8a3c\u306e\u4ed5\u69d8 (RFC2865) \u306b\u3088\u308b\u3068\u3001RADIUS \u306b\u516c\u5f0f\u306b\u5272\u308a\u5f53\u3066\u3089\u308c\u305f\u30dd\u30fc\u30c8\u756a\u53f7\u306f 1812 \u3067\u3059\u30021025 \u304b\u3089 65535 \u307e\u3067\u306e\u5024\u3092\u8a31\u53ef\u3057\u307e\u3059\u3002\u3059\u3079\u3066\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u8981\u6c42\u306f\u3001\u540c\u3058\u30dd\u30fc\u30c8\u3092\u4ecb\u3057\u3066\u51e6\u7406\u3055\u308c\u307e\u3059\u3002

c-radius-thread-pool-core-size=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b3\u30a2\u30b5\u30a4\u30ba
c-radius-thread-pool-core-size.help=ThreadPoolExecutor \u306e JavaDoc \u304b\u3089\u306e\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001Info \u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
c-radius-thread-pool-core-size.help.txt=RADIUS \u8981\u6c42\u3092\u53d7\u4fe1\u3057\u305f\u969b\u306b corePoolSize \u3088\u308a\u3082\u5c11\u306a\u3044\u30b9\u30ec\u30c3\u30c9\u304c\u5b9f\u884c\u4e2d\u306e\u5834\u5408\u306f\u3001\uffe5
\u4ed6\u306e\u30ef\u30fc\u30ab\u30fc\u30b9\u30ec\u30c3\u30c9\u304c\u30a2\u30a4\u30c9\u30eb\u72b6\u614b\u3067\u3042\u3063\u3066\u3082\u3001\u8981\u6c42\u3092\u51e6\u7406\u3059\u308b\u305f\u3081\u306b\u65b0\u3057\u3044\u30b9\u30ec\u30c3\u30c9\u304c\u751f\u6210\u3055\u308c\u307e\u3059\u3002\uffe5
\u30d7\u30fc\u30eb\u306e\u30b3\u30a2\u30b5\u30a4\u30ba\u3088\u308a\u591a\u304f\u6700\u5927\u30b5\u30a4\u30ba\u3088\u308a\u5c11\u306a\u3044\u30b9\u30ec\u30c3\u30c9\u304c\u5b9f\u884c\u4e2d\u306e\u5834\u5408\u3001\u65b0\u3057\u3044\u30b9\u30ec\u30c3\u30c9\u306f\u30ad\u30e5\u30fc\u304c\uffe5
\u3044\u3063\u3071\u3044\u306e\u5834\u5408\u306b\u306e\u307f\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002\u30d7\u30fc\u30eb\u306e\u30b3\u30a2\u30b5\u30a4\u30ba\u3068\u6700\u5927\u30b5\u30a4\u30ba\u3092\u540c\u3058\u5024\u306b\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u3067\u3001\uffe5
\u56fa\u5b9a\u30b5\u30a4\u30ba\u306e\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u304c\u4f5c\u6210\u3067\u304d\u307e\u3059\u3002\u5024\u306f 1 \u304b\u3089 100 \u306b\u5236\u9650\u3055\u308c\u3066\u3044\u307e\u3059\u3002<br/><br/>

d-radius-thread-pool-max-size=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u6700\u5927\u30b5\u30a4\u30ba
d-radius-thread-pool-max-size.help=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b3\u30a2\u30b5\u30a4\u30ba\u306e\u6ce8\u8a18\u3084\u7bc4\u56f2\u306e\u5236\u9650\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

e-radius-thread-pool-keepalive-seconds=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb Keep-Alive \u79d2\u6570
e-radius-thread-pool-keepalive-seconds.help=ThreadPoolExecutor \u306e JavaDoc \u304b\u3089\u306e\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001Info \u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
e-radius-thread-pool-keepalive-seconds.help.txt=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b3\u30a2\u30b5\u30a4\u30ba\u3092\u8d85\u3048\u308b\u30b9\u30ec\u30c3\u30c9\u304c\u30d7\u30fc\u30eb\u306b\u3042\u308b\u5834\u5408\u3001\u30a2\u30a4\u30c9\u30eb\u72b6\u614b\u306b\u306a\u3063\u3066\u304b\u3089 \
  Keep-Alive \u79d2\u3092\u8d85\u904e\u3057\u3066\u30b9\u30ec\u30c3\u30c9\u306f\u7d42\u4e86\u3057\u307e\u3059\u3002 \u5024\u306f 1 \u304b\u3089 3600 \u306b\u5236\u9650\u3055\u308c\u3066\u3044\u307e\u3059\u3002


f-radius-thread-pool-queue-size=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30ad\u30e5\u30fc\u30b5\u30a4\u30ba
f-radius-thread-pool-queue-size.help=\u30d7\u30fc\u30eb\u7528\u306e\u30ad\u30e5\u30fc\u306b\u5165\u308c\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u8981\u6c42\u306e\u6570\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001Info \u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
f-radius-thread-pool-queue-size.help.txt=\u30d7\u30fc\u30eb\u7528\u306e\u30ad\u30e5\u30fc\u306b\u5165\u308c\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u6570\u3092\u8d85\u3048\u305f\u8981\u6c42\u306f\u3001\u6697\u9ed9\u7684\u306b\u7834\u68c4\u3055\u308c\u307e\u3059\u3002\
\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u6700\u5927\u30b5\u30a4\u30ba\u3068\u306e\u76f8\u4e92\u4f5c\u7528\u306b\u3064\u3044\u3066\u306f\u3001\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b3\u30a2\u30b5\u30a4\u30ba\u306e\u6ce8\u8a18\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u5024\u306f 1 \u304b\u3089 100 \u306b\u5236\u9650\u3055\u308c\u3066\u3044\u307e\u3059\u3002


client-config-instance=Radius \u30af\u30e9\u30a4\u30a2\u30f3\u30c8

a-client-ip-address-label=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 IP \u30a2\u30c9\u30ec\u30b9
a-client-ip-address-label.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e IP \u30a2\u30c9\u30ec\u30b9\u3002
a-client-ip-address-label.help.txt=Section 5.4 of the RADIUS Authentication Specification, RFC 2865, indicates that \
  the source IP address of the Access-Request packet MUST be used to identify a configured client and thence determine \
  the shared secret to use for decrypting the User-Password field. The Client IP Address field should hold the source IP address of the \
  client. This should match the value obtained from Java's InetSocketAddress.getAddress().toString(). If there is any \
  question, send an Access-Request packet to OpenAM's RADIUS port and watch for a message stating, "No Defined RADIUS Client \
  matches IP address '/127.0.0.1'. Dropping request." Then copy the value in single quotes into this field.


b-client-secret-label=Client Secret
b-client-secret-label.help=This secret shared between server and client for encryption of the user password.
b-client-secret-label.help.txt=This secret must be conveyed to the RADIUS client and entered into its configuration \
before the User-Password field of incoming Access-Request packets can be decrypted to validate the password for the \
represented by that packet. A default value is generated for you but you can enter a custom value if desired.

c-client-log-packets=Log Packet Contents for this Client
c-client-log-packets.help=Indicates if full packet contents should be dumped to the log.
c-client-log-packets.help.txt=When troubleshooting issues with RADIUS it is helpful to know what was received in \
  a given packet. Enabling this feature will cause packet contents to be logged in a human consumable format. The \
  only caveat is that the USER_PASSWORD field will be obfiscated by replacing with asterisks. This should only be \
  enabled for troubleshooting as it adds significant content to logs and slows processing.


d-handler-class=Handler Class
d-handler-class.help=The fully qualified name of a class to handle incoming RADIUS Access-Requests for this client.
d-handler-class.help.txt=This class must implement the <code>com.sun.identity.authentication.modules.radius.server.spi.AccessRequestHandler</code> \
  interface to handle incoming Access-Request packets and provide a suitable response. An instance of this class is \
  created when configuration is first loaded to validate the class and then once for each new request. The configuration \
  properties will only be passed for the request handling instances and not when validating the class.<br/><br/><br/>

e-handler-config-params=Handler Class Configuration Properties
e-handler-config-params.help=Properties needed by the handler class for its configuration.
e-handler-config-params.help.txt=These properties are provided to the handler via its \
  <code>init</code> method prior to the call to handle the request packet. If these values are changed the next \
  handler instance created for an incoming request will receive the updated values. Each entry assumes that the first '=' \
  character incurred separates a key from its value. All entries are placed in a properties file handed to each handler \
  instance<br/><br/><br/>




