# The contents of this file are subject to the terms of the Common Development and
# Distribution License (the License). You may not use this file except in compliance with the
# License.
#
# You can obtain a copy of the License at legal/CDDLv1.0.txt. See the License for the
# specific language governing permission and limitations under the License.
#
# When distributing Covered Software, include this CDDL Header Notice in each file and include
# the License file at legal/CDDLv1.0.txt. If applicable, add the following below the CDDL
# Header, with the fields enclosed by brackets [] replaced by your own identifying
# information: "Portions copyright [year] [name of copyright owner]".
#
# Portions Copyright 2016 Nomura Research Institute, Ltd.

radius-server-service-description=RADIUS \u30b5\u30fc\u30d0\u30fc

a-radius-listener-enabled-label=\u6709\u52b9\u5316
a-radius-listener-enabled-label.help=\u6709\u52b9\u306b\u3059\u308b\u3068\u3001RADIUS \u30b5\u30fc\u30d0\u30fc\u306f\u5c02\u7528\u306e\u30dd\u30fc\u30c8\u3092\u30aa\u30fc\u30d7\u30f3\u3057\u3066\u8981\u6c42\u3092\u30ea\u30c3\u30b9\u30f3\u3057\u307e\u3059\u3002
choiceYES=YES
choiceNO=NO

b-radius-port=\u30ea\u30b9\u30ca\u30fc\u30dd\u30fc\u30c8
b-radius-port.help=\u5404 OpenAM \u30b5\u30fc\u30d0\u30fc\u304c RADIUS \u306e Access-Request \u30d1\u30b1\u30c3\u30c8\u3092\u30ea\u30c3\u30b9\u30f3\u3059\u308b UDP \u30dd\u30fc\u30c8\u3002
b-radius-port.help.txt=RADIUS \u8a8d\u8a3c\u306e\u4ed5\u69d8 (RFC 2865) \u306b\u3088\u308b\u3068\u3001RADIUS \u306b\u516c\u5f0f\u306b\u5272\u308a\u5f53\u3066\u3089\u308c\u305f\u30dd\u30fc\u30c8\u756a\u53f7\u306f 1812 \u3067\u3059\u30021025 \u304b\u3089 65535 \u307e\u3067\u306e\u5024\u3092\u8a31\u53ef\u3057\u307e\u3059\u3002\u3059\u3079\u3066\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u8981\u6c42\u306f\u3001\u540c\u3058\u30dd\u30fc\u30c8\u3092\u4ecb\u3057\u3066\u51e6\u7406\u3055\u308c\u307e\u3059\u3002

c-radius-thread-pool-core-size=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b3\u30a2\u30b5\u30a4\u30ba
c-radius-thread-pool-core-size.help=ThreadPoolExecutor \u306e JavaDoc \u304b\u3089\u306e\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001Info \u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
c-radius-thread-pool-core-size.help.txt=RADIUS \u8981\u6c42\u3092\u53d7\u4fe1\u3057\u305f\u969b\u306b corePoolSize \u3088\u308a\u3082\u5c11\u306a\u3044\u30b9\u30ec\u30c3\u30c9\u304c\u5b9f\u884c\u4e2d\u306e\u5834\u5408\u306f\u3001\
  \u4ed6\u306e\u30ef\u30fc\u30ab\u30fc\u30b9\u30ec\u30c3\u30c9\u304c\u30a2\u30a4\u30c9\u30eb\u72b6\u614b\u3067\u3042\u3063\u3066\u3082\u3001\u8981\u6c42\u3092\u51e6\u7406\u3059\u308b\u305f\u3081\u306b\u65b0\u3057\u3044\u30b9\u30ec\u30c3\u30c9\u304c\u751f\u6210\u3055\u308c\u307e\u3059\u3002\
  \u30d7\u30fc\u30eb\u306e\u30b3\u30a2\u30b5\u30a4\u30ba\u3088\u308a\u591a\u304f\u6700\u5927\u30b5\u30a4\u30ba\u3088\u308a\u5c11\u306a\u3044\u30b9\u30ec\u30c3\u30c9\u304c\u5b9f\u884c\u4e2d\u306e\u5834\u5408\u3001\u65b0\u3057\u3044\u30b9\u30ec\u30c3\u30c9\u306f\u30ad\u30e5\u30fc\u304c\
  \u3044\u3063\u3071\u3044\u306e\u5834\u5408\u306b\u306e\u307f\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002\u30d7\u30fc\u30eb\u306e\u30b3\u30a2\u30b5\u30a4\u30ba\u3068\u6700\u5927\u30b5\u30a4\u30ba\u3092\u540c\u3058\u5024\u306b\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u3067\u3001\
  \u56fa\u5b9a\u30b5\u30a4\u30ba\u306e\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u304c\u4f5c\u6210\u3067\u304d\u307e\u3059\u3002\u5024\u306f 1 \u304b\u3089 100 \u306b\u5236\u9650\u3055\u308c\u3066\u3044\u307e\u3059\u3002<br/><br/>

d-radius-thread-pool-max-size=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u6700\u5927\u30b5\u30a4\u30ba
d-radius-thread-pool-max-size.help=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b3\u30a2\u30b5\u30a4\u30ba\u306e\u6ce8\u8a18\u3084\u7bc4\u56f2\u306e\u5236\u9650\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

e-radius-thread-pool-keepalive-seconds=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb Keep-Alive \u79d2\u6570
e-radius-thread-pool-keepalive-seconds.help=ThreadPoolExecutor \u306e JavaDoc \u304b\u3089\u306e\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001Info \u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
e-radius-thread-pool-keepalive-seconds.help.txt=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b3\u30a2\u30b5\u30a4\u30ba\u3092\u8d85\u3048\u308b\u30b9\u30ec\u30c3\u30c9\u304c\u30d7\u30fc\u30eb\u306b\u3042\u308b\u5834\u5408\u3001\u30a2\u30a4\u30c9\u30eb\u72b6\u614b\u306b\u306a\u3063\u3066\u304b\u3089 \
  Keep-Alive \u79d2\u3092\u8d85\u904e\u3057\u3066\u30b9\u30ec\u30c3\u30c9\u306f\u7d42\u4e86\u3057\u307e\u3059\u3002 \u5024\u306f 1 \u304b\u3089 3600 \u306b\u5236\u9650\u3055\u308c\u3066\u3044\u307e\u3059\u3002


f-radius-thread-pool-queue-size=\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30ad\u30e5\u30fc\u30b5\u30a4\u30ba
f-radius-thread-pool-queue-size.help=\u30d7\u30fc\u30eb\u7528\u306e\u30ad\u30e5\u30fc\u306b\u5165\u308c\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u8981\u6c42\u306e\u6570\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001Info \u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
f-radius-thread-pool-queue-size.help.txt=\u30d7\u30fc\u30eb\u7528\u306e\u30ad\u30e5\u30fc\u306b\u5165\u308c\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u6570\u3092\u8d85\u3048\u305f\u8981\u6c42\u306f\u3001\u6697\u9ed9\u7684\u306b\u7834\u68c4\u3055\u308c\u307e\u3059\u3002\
  \u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u6700\u5927\u30b5\u30a4\u30ba\u3068\u306e\u76f8\u4e92\u4f5c\u7528\u306b\u3064\u3044\u3066\u306f\u3001\u30b9\u30ec\u30c3\u30c9\u30d7\u30fc\u30eb\u30b3\u30a2\u30b5\u30a4\u30ba\u306e\u6ce8\u8a18\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u5024\u306f 1 \u304b\u3089 100 \u306b\u5236\u9650\u3055\u308c\u3066\u3044\u307e\u3059\u3002


client-config-instance=Radius \u30af\u30e9\u30a4\u30a2\u30f3\u30c8

a-client-ip-address-label=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 IP \u30a2\u30c9\u30ec\u30b9
a-client-ip-address-label.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e IP \u30a2\u30c9\u30ec\u30b9\u3002
a-client-ip-address-label.help.txt=RADIUS \u8a8d\u8a3c\u4ed5\u69d8\u306e RFC2865 \u306e 5.4 \u7bc0\u3067\u306f\u3001Access-Request \u30d1\u30b1\u30c3\u30c8\u306e\u9001\u4fe1\u5143 IP \u30a2\u30c9\u30ec\u30b9\u306f\u3001\
  \u8a2d\u5b9a\u3055\u308c\u305f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3092\u7279\u5b9a\u3057\u3001\u305d\u3053\u304b\u3089 User-Password \u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u5fa9\u53f7\u5316\u306b\u4f7f\u7528\u3059\u308b\u5171\u6709\u30b7\u30fc\u30af\u30ec\u30c3\u30c8\u3092\u6c7a\u5b9a\u3059\u308b\u305f\u3081\u306b\u3001\
  \u4f7f\u7528\u3055\u308c\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u3053\u3068\u3092\u793a\u3057\u3066\u3044\u307e\u3059\u3002Client IP Address\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u9001\u4fe1\u5143 IP \u30a2\u30c9\u30ec\u30b9\u3092\u4fdd\u6301\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\
  \u3053\u308c\u306f Java \u306e InetSocketAddress.getAddress().toString() \u304b\u3089\u5f97\u3089\u308c\u305f\u5024\u3068\u4e00\u81f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u9580\u984c\u304c\u3042\u308b\u5834\u5408\u306f\u3001\
  OpenAM \u306e RADIUS \u30dd\u30fc\u30c8\u306b Access-Request \u30d1\u30b1\u30c3\u30c8\u3092\u9001\u4fe1\u3057\u3001"No Defined RADIUS Client matches IP address '/127.0.0.1'. \
  Dropping request." \u3068\u3044\u3046\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u76e3\u8996\u3057\u3001\u30b7\u30f3\u30b0\u30eb\u30af\u30a9\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u3067\u56f2\u3093\u3060\u5024\u3092\u305d\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u30b3\u30d4\u30fc\u3057\u307e\u3059\u3002\


b-client-secret-label=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b7\u30fc\u30af\u30ec\u30c3\u30c8
b-client-secret-label.help=\u3053\u306e\u30b7\u30fc\u30af\u30ec\u30c3\u30c8\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6697\u53f7\u5316\u306e\u305f\u3081\u306b\u3001\u30b5\u30fc\u30d0\u30fc\u3068\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u9593\u3067\u5171\u6709\u3055\u308c\u307e\u3059\u3002
b-client-secret-label.help.txt=\u53d7\u4fe1\u3057\u305f Access-Request \u30d1\u30b1\u30c3\u30c8\u306b\u3088\u3063\u3066\u8868\u3055\u308c\u305f\u3082\u306e\u304c\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u3042\u308b\u3053\u3068\u3092\u691c\u8a3c\u3059\u308b\u305f\u3081\u3001\
  \u305d\u306e\u30d1\u30b1\u30c3\u30c8\u306e User-Password \u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u5fa9\u53f7\u5316\u3067\u304d\u308b\u3088\u3046\u306b\u3001\u3053\u306e\u30b7\u30fc\u30af\u30ec\u30c3\u30c8\u306f\u3001RADIUS \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u4f1d\u9054\u3057\u3001\
  \u305d\u306e\u8a2d\u5b9a\u306b\u5165\u529b\u3055\u308c\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u304c\u81ea\u52d5\u7684\u306b\u751f\u6210\u3055\u308c\u307e\u3059\u304c\u3001\u5e0c\u671b\u3059\u308b\u5834\u5408\u306f\u30ab\u30b9\u30bf\u30e0\u5024\u3092\u5165\u529b\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002


c-client-log-packets=\u3053\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u30d1\u30b1\u30c3\u30c8\u306e\u5185\u5bb9\u3092\u30ed\u30b0\u306b\u8a18\u9332
c-client-log-packets.help=\u5b8c\u5168\u306a\u30d1\u30b1\u30c3\u30c8\u306e\u5185\u5bb9\u3092\u30ed\u30b0\u306b\u30c0\u30f3\u30d7\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u793a\u3057\u307e\u3059\u3002
c-client-log-packets.help.txt=RADIUS \u306e\u554f\u984c\u306e\u30c8\u30e9\u30d6\u30eb\u30b7\u30e5\u30fc\u30c6\u30a3\u30f3\u30b0\u3092\u884c\u3046\u969b\u306f\u3001\u4e0e\u3048\u3089\u308c\u305f\u30d1\u30b1\u30c3\u30c8\u306b\u4f55\u304c\
  \u53d7\u4fe1\u3055\u308c\u305f\u304b\u3092\u77e5\u308b\u3053\u3068\u304c\u6709\u7528\u3067\u3059\u3002\u3053\u306e\u6a5f\u80fd\u3092\u6709\u52b9\u306b\u3059\u308b\u3068\u3001\u30d1\u30b1\u30c3\u30c8\u306e\u5185\u5bb9\u306f\u4eba\u9593\u304c\u89e3\u6790\u3067\u304d\u308b\u5f62\u5f0f\u3067\
  \u8a18\u9332\u3055\u308c\u307e\u3059\u3002\u552f\u4e00\u306e\u6ce8\u610f\u70b9\u306f\u3001USER_PASSWORD \u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u30a2\u30b9\u30bf\u30ea\u30b9\u30af\u3067\u7f6e\u304d\u63db\u3048\u3089\u308c\u308b\u3068\u3044\u3046\u3053\u3068\u3067\u3059\u3002\
  \u30ed\u30b0\u306b\u91cd\u8981\u306a\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u8ffd\u52a0\u3055\u308c\u3001\u51e6\u7406\u304c\u9045\u304f\u306a\u308b\u305f\u3081\u3001\u30c8\u30e9\u30d6\u30eb\u30b7\u30e5\u30fc\u30c6\u30a3\u30f3\u30b0\u306e\u76ee\u7684\u3067\u306e\u307f\
  \u3053\u308c\u3092\u6709\u52b9\u306b\u3059\u3079\u304d\u3067\u3059\u3002

d-handler-class=\u30cf\u30f3\u30c9\u30e9\u30af\u30e9\u30b9
d-handler-class.help=\u3053\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u53d7\u4fe1\u3057\u305f RADIUS \u306e Access-Request \u3092\u51e6\u7406\u3059\u308b\u30af\u30e9\u30b9\u306e\u5b8c\u5168\u4fee\u98fe\u540d\u3002
d-handler-class.help.txt=\u3053\u306e\u30af\u30e9\u30b9\u306f\u3001\u53d7\u4fe1\u3057\u305f RADIUS \u306e Access-Request \u3092\u51e6\u7406\u3057\u3001\u9069\u5207\u306a\u5fdc\u7b54\u3092\u63d0\u4f9b\u3059\u308b\u305f\u3081\u306b\u3001\
  <code>com.sun.identity.authentication.modules.radius.server.spi.AccessRequestHandler</code> \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30a4\u30b9\u3092\u5b9f\u88c5\u3059\u308b\
  \u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u30af\u30e9\u30b9\u3092\u691c\u8a3c\u3059\u308b\u305f\u3081\u306b\u8a2d\u5b9a\u304c\u6700\u521d\u306b\u30ed\u30fc\u30c9\u3055\u308c\u3001\u305d\u306e\u5f8c\u306e\u65b0\u3057\u3044\u8981\u6c42\u304c\u3042\u308b\u5ea6\u306b\u3053\u306e\u30af\u30e9\u30b9\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\
  \u4f5c\u6210\u3055\u308c\u307e\u3059\u3002\u30af\u30e9\u30b9\u3092\u691c\u8a3c\u3059\u308b\u5834\u5408\u3001\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u30ea\u30af\u30a8\u30b9\u30c8\u51e6\u7406\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u5bfe\u3057\u3066\u306e\u307f\u6e21\u3055\u308c\u307e\u3059\u3002<br/><br/><br/>

e-handler-config-params=\u30cf\u30f3\u30c9\u30e9\u30af\u30e9\u30b9\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
e-handler-config-params.help=\u30cf\u30f3\u30c9\u30e9\u30af\u30e9\u30b9\u306e\u8a2d\u5b9a\u306b\u5fc5\u8981\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u3002
e-handler-config-params.help.txt=\u3053\u308c\u3089\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001\u8981\u6c42\u30d1\u30b1\u30c3\u30c8\u3092\u51e6\u7406\u3059\u308b\u305f\u3081\u306e\u547c\u3073\u51fa\u3057\u306e\u524d\u306b <code>init</code> \
  \u30e1\u30bd\u30c3\u30c9\u3092\u4ecb\u3057\u3066\u3001\u30cf\u30f3\u30c9\u30e9\u306b\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u3089\u306e\u5024\u304c\u66f4\u65b0\u3055\u308c\u305f\u5834\u5408\u3001\u53d7\u4fe1\u3057\u305f\u8981\u6c42\u306b\u5bfe\u3057\u3066\u4f5c\u6210\u3055\u308c\u308b\u6b21\u306e\u30cf\u30f3\u30c9\u30e9\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u3001\
  \u5909\u66f4\u3055\u308c\u305f\u5024\u3092\u53d7\u4fe1\u3059\u308b\u3053\u3068\u306b\u306a\u308a\u307e\u3059\u3002\u5404\u30a8\u30f3\u30c8\u30ea\u306f\u3001\u751f\u3058\u305f\u6700\u521d\u306e '=' \u6587\u5b57\u304c\u305d\u306e\u5024\u304b\u3089\u30ad\u30fc\u3092\u5206\u96e2\u3059\u308b\u3053\u3068\u3092\u60f3\u5b9a\u3057\u3066\u3044\u307e\u3059\u3002\
\u3059\u3079\u3066\u306e\u30a8\u30f3\u30c8\u30ea\u306f\u3001\u5404\u30cf\u30f3\u30c9\u30e9\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u6e21\u3055\u308c\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306b\u914d\u7f6e\u3055\u308c\u307e\u3059\u3002<br/><br/><br/>



